WIFI-DMX/STM32ISP/STM32ISPDlg.cpp
// STM32ISPDlg.cpp : implementation file
//
//wifi-dmx.com
#include "stdafx.h"
#include "STM32ISP.h"
#include "STM32ISPDlg.h"
#include "Class\ClassXP.h"
#include "Class\fifo.h"
#include "STMISP.h"
#include "Pcomm.h"
#include "Ini.h"


#ifdef _DEBUG
#define new DEBUG_NEW
#undef THIS_FILE
static char THIS_FILE[] = __FILE__;
#endif

BIN_st Update;
int
ADDR_i=0,
Port,
Bps,
Type,
Time,
My_BpsChoose=0;
///////////////////////////////////////////////////////////////////////////////////////////////
// Options Bytes Areas

DWORD ADDR_F1_OPB     = 0x1FFFF800;
DWORD ADDR_F2_OPB     = 0x1FFFC000;
DWORD ADDR_L1_OPB     = 0x1FF80000;
 
// STM32F1 Series
DWORD ADDR_USER_OPB    = 0x1FFFF800;
DWORD ADDR_DATA_OPB    = 0x1FFFF804;
DWORD ADDR_RDP_OPB     = 0x1FFFF800;
DWORD ADDR_WRP0_OPB    = 0x1FFFF808;
DWORD ADDR_WRP2_OPB    = 0x1FFFF80C;

DWORD ADDR_FLASH_SIZE  = 0x1FFFF7E0;

#define WRITE_PAGENUM  256
#define WAIT_Timeout   10
#define Print_Enable   (1)
#define DownLoad_Time  (10)

const DWORD  MAX_DATA_SIZE   = 0xFF;  // Packet size(in byte)
BYTE   ACK                   = 0x79;
BYTE   NACK                  = 0x1F;

ACKS ACK_VALUE          = ST79;
LPTARGET_DESCRIPTOR Target;
ACKS   McuTarget;
DWORD  Progress;
DWORD  ActivityTime;

IAP_Type myiap={
0,0,0,
};
unsigned int ISP_Address = 0x00,StartAddr = 0x00,EndAddr = 0x00,FlashSize=0,Go_Run=1;
//////////////////////////////////////////////////////////////////////////////////////////

VOID CALLBACK TxEmptyIrq(int port);
VOID CALLBACK CntIrq(int port) ;
BOOL HexFileSave(const char *filename, void* lpBuffer, DWORD dwCount);
BOOL HexFileRead(const char *filename, void* lpBuffer,int*Updatelen);
/////////////////////////////////////////////////////////////////////////////
// CAboutDlg dialog used for App About

class CAboutDlg : public CDialog
{
public:
	CAboutDlg();

// Dialog Data
	//{{AFX_DATA(CAboutDlg)
	enum { IDD = IDD_ABOUTBOX };
	//}}AFX_DATA

	// ClassWizard generated virtual function overrides
	//{{AFX_VIRTUAL(CAboutDlg)
	protected:
	virtual void DoDataExchange(CDataExchange* pDX);    // DDX/DDV support
	//}}AFX_VIRTUAL

// Implementation
protected:
	//{{AFX_MSG(CAboutDlg)
	//}}AFX_MSG
	DECLARE_MESSAGE_MAP()
};

CAboutDlg::CAboutDlg() : CDialog(CAboutDlg::IDD)
{
	//{{AFX_DATA_INIT(CAboutDlg)
	//}}AFX_DATA_INIT
}

void CAboutDlg::DoDataExchange(CDataExchange* pDX)
{
	CDialog::DoDataExchange(pDX);
	//{{AFX_DATA_MAP(CAboutDlg)
	//}}AFX_DATA_MAP
}

BEGIN_MESSAGE_MAP(CAboutDlg, CDialog)
	//{{AFX_MSG_MAP(CAboutDlg)
		// No message handlers
	//}}AFX_MSG_MAP
END_MESSAGE_MAP()

/////////////////////////////////////////////////////////////////////////////
// CSTM32ISPDlg dialog

CSTM32ISPDlg::CSTM32ISPDlg(CWnd* pParent /*=NULL*/)
	: CDialog(CSTM32ISPDlg::IDD, pParent)
{
	//{{AFX_DATA_INIT(CSTM32ISPDlg)
	m_valuefile = _T("E:\\项目\\XY-012A(PRO) 程序\\备份\\XY-012A-V1_13-S.bin");
	//}}AFX_DATA_INIT
	// Note that LoadIcon does not require a subsequent DestroyIcon in Win32
	m_hIcon = AfxGetApp()->LoadIcon(IDR_MAINFRAME);
}

void CSTM32ISPDlg::DoDataExchange(CDataExchange* pDX)
{
	CDialog::DoDataExchange(pDX);
	//{{AFX_DATA_MAP(CSTM32ISPDlg)
	DDX_Control(pDX, IDC_TAB1, m_tab1);
	DDX_Control(pDX, IDC_COMBO_DTR, m_ctrldtr);
	DDX_Control(pDX, IDC_EDIT_File, m_ctrlfile);
	DDX_Control(pDX, IDC_COMBO_Port, m_ctrlport);
	DDX_Control(pDX, IDC_COMBO_Bps, m_ctrlbps);
	DDX_Control(pDX, IDC_PROGRESS1, m_ctrlprogress);
	DDX_Control(pDX, IDC_EDIT_OutPut, m_output);
	DDX_Text(pDX, IDC_EDIT_File, m_valuefile);
	//}}AFX_DATA_MAP
}

BEGIN_MESSAGE_MAP(CSTM32ISPDlg, CDialog)
	//{{AFX_MSG_MAP(CSTM32ISPDlg)
	ON_WM_SYSCOMMAND()
	ON_WM_PAINT()
	ON_WM_QUERYDRAGICON()
	ON_WM_SIZE()
	ON_WM_TIMER()
	ON_BN_CLICKED(IDC_BUTTON_OpenFile, OnBUTTONOpenFile)
	ON_BN_CLICKED(IDC_CHECK_GO, OnCheckGo)
	ON_NOTIFY(TCN_SELCHANGE, IDC_TAB1, OnSelchangeTab1)
	//}}AFX_MSG_MAP
	ON_MESSAGE(WM_INFO, OnMyInfo)
	ON_MESSAGE(WM_PCOMM, OnPcomm) //这里是消息影射
	ON_MESSAGE(WM_PCOMMSEND, SendPcomm) //这里是消息影射
	ON_MESSAGE(WM_START_KEYDOWM, OnStartKeydowm)
END_MESSAGE_MAP()

/////////////////////////////////////////////////////////////////////////////
// CSTM32ISPDlg message handlers

BOOL CSTM32ISPDlg::OnInitDialog()
{
	CDialog::OnInitDialog();

	// Add "About..." menu item to system menu.

	// IDM_ABOUTBOX must be in the system command range.
	ASSERT((IDM_ABOUTBOX & 0xFFF0) == IDM_ABOUTBOX);
	ASSERT(IDM_ABOUTBOX < 0xF000);

	CMenu* pSysMenu = GetSystemMenu(FALSE);
	if (pSysMenu != NULL)
	{
		CString strAboutMenu;
		strAboutMenu.LoadString(IDS_ABOUTBOX);
		if (!strAboutMenu.IsEmpty())
		{
			pSysMenu->AppendMenu(MF_SEPARATOR);
			pSysMenu->AppendMenu(MF_STRING, IDM_ABOUTBOX, strAboutMenu);
		}
	}

	// Set the icon for this dialog.  The framework does this automatically
	//  when the application's main window is not a dialog
	SetIcon(m_hIcon, TRUE);			// Set big icon
	SetIcon(m_hIcon, FALSE);		// Set small icon
	
	// TODO: Add extra initialization here

	ClassXP();

	State = 1314;

    CRect Rect ;
    GetClientRect(&Rect);
	old.x=Rect.right-Rect.left;
	old.y=Rect.bottom-Rect.top;

	ScanPort();
	m_ctrlbps.InsertString(0, "115200");
	m_ctrlbps.InsertString(1, "250000");
	m_ctrlbps.SetCurSel(0);

	FifoInit(&MyFifo);
/*
	CFont m_font;
	m_font.CreateFont(16,0,0,0,FW_BOLD, 0,0,0,
		DEFAULT_CHARSET, OUT_CHARACTER_PRECIS, CLIP_CHARACTER_PRECIS,
		DEFAULT_QUALITY, DEFAULT_PITCH | FF_DONTCARE, "Arial");
	m_ctrlstart.SetFont(&m_font);
*/

	m_output.GetWindowRect(&Rect);
	ScreenToClient(&Rect);

	OldTLPoint[0] = Rect.TopLeft();
	OldBRPoint[0] = Rect.BottomRight();

	Rect.SetRect(OldTLPoint[0],OldBRPoint[0]);
	m_output.MoveWindow(Rect,TRUE);

	
	m_ctrlprogress.GetWindowRect(&Rect);
	ScreenToClient(&Rect);

	OldTLPoint[1] = Rect.TopLeft();
	OldBRPoint[1] = Rect.BottomRight();

	Rect.SetRect(OldTLPoint[1],OldBRPoint[1]);
	m_ctrlprogress.MoveWindow(Rect,TRUE);

	GetFile();

