WIFI-DMX/STM32ISP/STM32ISPDlg.cpp
	m_ctrldtr.SetCurSel(0);


	m_tab1.InsertItem(0,_T("ISP"));
	m_tab1.InsertItem(1,_T("IAP"));
	m_myisp.Create(IDD_DIALOG_ISP,GetDlgItem(IDC_TAB1));
	m_myiap.Create(IDD_DIALOG_IAP,GetDlgItem(IDC_TAB1));

	CRect rs;
	m_tab1.GetClientRect(&rs);
    rs.top+=20;
	rs.bottom-=0;
	rs.left+=0;
	rs.right-=0;

    m_myisp.MoveWindow(&rs);
	m_myiap.MoveWindow(&rs);
	m_myisp.ShowWindow(true);
	m_myiap.ShowWindow(false);
	m_tab1.SetCurSel(0);
	return TRUE;  // return TRUE  unless you set the focus to a control
}

void CSTM32ISPDlg::OnSysCommand(UINT nID, LPARAM lParam)
{
	if ((nID & 0xFFF0) == IDM_ABOUTBOX)
	{
		CAboutDlg dlgAbout;
		dlgAbout.DoModal();
	}
	else
	{
		CDialog::OnSysCommand(nID, lParam);
	}
}

// If you add a minimize button to your dialog, you will need the code below
//  to draw the icon.  For MFC applications using the document/view model,
//  this is automatically done for you by the framework.

void CSTM32ISPDlg::OnPaint() 
{
	if (IsIconic())
	{
		CPaintDC dc(this); // device context for painting

		SendMessage(WM_ICONERASEBKGND, (WPARAM) dc.GetSafeHdc(), 0);

		// Center icon in client rectangle
		int cxIcon = GetSystemMetrics(SM_CXICON);
		int cyIcon = GetSystemMetrics(SM_CYICON);
		CRect rect;
		GetClientRect(&rect);
		int x = (rect.Width() - cxIcon + 1) / 2;
		int y = (rect.Height() - cyIcon + 1) / 2;

		// Draw the icon
		dc.DrawIcon(x, y, m_hIcon);
	}
	else
	{
		CDialog::OnPaint();
	}
}

// The system calls this to obtain the cursor to display while the user drags
//  the minimized window.
HCURSOR CSTM32ISPDlg::OnQueryDragIcon()
{
	return (HCURSOR) m_hIcon;
}

void CSTM32ISPDlg::OnSize(UINT nType, int cx, int cy) 
{
	CDialog::OnSize(nType, cx, cy);
	
	if(State!=1314)return;
	// TODO: Add your message handler code here
    if((nType == SIZE_RESTORED)||(nType == SIZE_MAXIMIZED)){
		
		CRect Recta,Rect;
		float fsp[2];
		POINT Newp;
		GetClientRect(&Recta);
		Newp.x=Recta.right-Recta.left;
	    Newp.y=Recta.bottom-Recta.top;

		fsp[0]=(float)Newp.x/old.x;
		fsp[1]=(float)Newp.y/old.y;
		
		CString a;
		a.Format("fsp[0]: %f fsp[1]: %f\r\n", fsp[0],fsp[1]);
		//m_output.ReplaceSel(a);

		if((fsp[0]<1)||(fsp[1]<1))return;

		m_output.GetWindowRect(&Rect);
		ScreenToClient(&Rect);

		CPoint TLPoint[3];//左上
		CPoint BRPoint[3];//右下

		TLPoint[0].x= long(OldTLPoint[0].x*1);
		TLPoint[0].y= long(OldTLPoint[0].y*1);
		BRPoint[0].x= long(OldBRPoint[0].x*fsp[0]);
		BRPoint[0].y= long(OldBRPoint[0].y*fsp[1]);
		Rect.SetRect(TLPoint[0],BRPoint[0]);

		m_output.MoveWindow(Rect,TRUE);

		TLPoint[1].x= long(OldTLPoint[1].x*1);
		TLPoint[1].y= long(OldTLPoint[1].y*fsp[1]);
		BRPoint[1].x= long(OldBRPoint[1].x*fsp[0]);
		BRPoint[1].y= long(OldBRPoint[1].y*fsp[1]);
		Rect.SetRect(TLPoint[1],BRPoint[1]);

		m_ctrlprogress.MoveWindow(Rect,TRUE);        //old=Newp;
		
		//m_output.MoveWindow(203+102,460+22,Rect.Width()-(203+102)-8,Rect.Height()-(460+22)-7-54,TRUE);
	}	
}

void CSTM32ISPDlg::OnTimer(UINT nIDEvent) 
{
	// TODO: Add your message handler code here and/or call default
	Time++;
/*
    CString a;
	a.Format("\r\nConnectting ... %d ",Time);
	m_output.SetSel(28,-1);
	m_output.ReplaceSel(a);

	 
    volatile unsigned char UDR;
    if(MyFifo.count){
			if(FifoOut(&MyFifo,&UDR)==FifoNormal){
                CString a;
			    a.Format("%02X ",(unsigned char)UDR);
	   	        m_output.ReplaceSel(a);
			}
	}
*/
	STBL_Init_BL();
	CDialog::OnTimer(nIDEvent);
}


void CSTM32ISPDlg::ScanPort()
{
	CStringArray arry_str_COM;
	for(int i=0;i<GetSerialPort(arry_str_COM);i++)
	{
		((CComboBox *)GetDlgItem(IDC_COMBO_Port))->InsertString(i,arry_str_COM.GetAt(i));
	}
	((CComboBox *)GetDlgItem(IDC_COMBO_Port))->SetCurSel(0);
}

int CSTM32ISPDlg::GetSerialPort(CStringArray &arrCom)
{
		//CStringArray ary;
		arrCom.RemoveAll(); 
		HKEY   hkey;     
		LONG   lRes   =   RegOpenKeyEx(HKEY_LOCAL_MACHINE, _T( "HARDWARE\\DEVICEMAP\\SERIALCOMM"), NULL, KEY_QUERY_VALUE   |   KEY_ENUMERATE_SUB_KEYS   |   KEY_READ,   &hkey);     
		if   (lRes   ==   ERROR_SUCCESS)     
		{ 
			TCHAR   tchKey[MAX_PATH];     
			TCHAR   tchValue[20]; 
			DWORD   dwIndex   =   0; 
			DWORD   dwType   =   REG_SZ; 
			while(lRes   ==   ERROR_SUCCESS) 
			{ 
				DWORD   dwCount   =   MAX_PATH; 
				DWORD   dwVCount   =   20; 
				lRes   =   RegEnumValue(hkey,   dwIndex++,   tchKey,   &dwCount,   NULL,   &dwType,   (LPBYTE)tchValue,   &dwVCount); 
				if(lRes   ==   ERROR_SUCCESS) 
				{ 
					if((dwVCount   >   0)   &&   (dwCount   >   0)) 
					{ 
						arrCom.Add(tchValue);
						//ary.Add(tchValue);
					} 
				} 
			} 
		}
		RegCloseKey(hkey); 
		
		
	return   arrCom.GetSize();
}

/*******************************************************************************************/
/* Function    : FileExist                                                                 */
/* IN          : file name                                                                 */
/* OUT         : boolean                                                                   */
/* Description : verify if the given file exists                                           */
/*******************************************************************************************/
BOOL CSTM32ISPDlg::FileExist(LPCTSTR filename)
{
	// Data structure for FindFirstFile
	WIN32_FIND_DATA findData;

	// Clear find structure
	ZeroMemory(&findData, sizeof(findData));

	// Search the file
	HANDLE hFind = FindFirstFile( filename, &findData );
	if ( hFind == INVALID_HANDLE_VALUE )
	{
	// File not found
	return false;
	}

	// File found

	// Release find handle
	FindClose( hFind );
	hFind = NULL;

	// The file exists
	return true;
}

void CSTM32ISPDlg::ChangeFile(void) 
{
	
	CString Path(AfxGetApp()->m_pszHelpFilePath);
	char Drive[3], Dir[256], Fname[256], Ext[256];
    _splitpath(Path,Drive,Dir,Fname,Ext);
	
	CString ConfFile;
	ConfFile.Format("%s%s%s", Drive, Dir , "Default.conf");

	CIni Ini((LPCSTR)ConfFile);

	UpdateData(TRUE);
	Ini.WriteString((LPCTSTR)"File",(LPCTSTR)"Name", (LPCTSTR)m_valuefile);
	UpdateData(FALSE);

