WIFI-DMX/STM32ISP/STM32ISPDlg.cpp
	// TODO: Add your control notification handler code here	
}

void CSTM32ISPDlg::GetFile(void) 
{

	CString Path(AfxGetApp()->m_pszHelpFilePath);
	char Drive[3], Dir[256], Fname[256], Ext[256];
    _splitpath(Path,Drive,Dir,Fname,Ext);
	
	CString ConfFile;
	ConfFile.Format("%s%s%s", Drive, Dir , "Default.conf");

    //m_output.ReplaceSel(ConfFile);

	if(!FileExist((LPCTSTR)ConfFile))
	{
		FILE* fp = fopen((LPCTSTR)ConfFile, "a+");//file %s does not exist .. Creating file
		if(fp)fclose(fp);
		m_valuefile="";
		UpdateData(TRUE);
		return;
	}

	CIni Ini((LPCSTR)ConfFile);

	UpdateData(TRUE);
	m_valuefile=(LPCTSTR) Ini.GetString((LPCTSTR)"File",(LPCTSTR)"Name", "0");
	Go_Run=Ini.GetBool((LPCTSTR)"CMD",(LPCTSTR)"Go_Run", TRUE);
	UpdateData(FALSE);

	if(Go_Run){
		((CButton*)GetDlgItem(IDC_CHECK_GO))->SetCheck(TRUE);
	}
	else{
		((CButton*)GetDlgItem(IDC_CHECK_GO))->SetCheck(FALSE);
	}
	// TODO: Add your control notification handler code here	
}

void CSTM32ISPDlg::OnBUTTONOpenFile() 
{
	// TODO: Add your control notification handler code here
	_TCHAR Drive[3], Dir[256], Fname[256], Ext[256];
	_TCHAR *ptr;
	BOOL bRet=FALSE;
	
	OPENFILENAME ofn;
	char szFile[MAX_PATH];
	ZeroMemory(&ofn,sizeof(ofn));
	ofn.lStructSize = sizeof(ofn);
	ofn.lpstrFile = szFile;
	ofn.lpstrFile[0] = TEXT('\0');
	ofn.nMaxFile = sizeof(szFile);
	ofn.lpstrFilter = TEXT("(*.bin;*.hex)\0*.bin;*.hex\0");
	ofn.nFilterIndex = 1;
	ofn.lpstrFileTitle = NULL;
	ofn.nMaxFileTitle = 0;
	ofn.lpstrInitialDir = NULL;
	ofn.Flags = OFN_EXPLORER |OFN_PATHMUSTEXIST | OFN_FILEMUSTEXIST | OFN_READONLY;
	ofn.hwndOwner = ::AfxGetMainWnd()->m_hWnd;

    m_ctrlfile.SetSel(0,0);
    m_ctrlfile.SetSel(-1);
    m_ctrlfile.SetSel(0,-1);
    m_ctrlfile.ReplaceSel("");

	if (GetOpenFileName(&ofn))
	{
		//::MessageBox(NULL,szFile,"",MB_OK);
		m_ctrlfile.SetReadOnly(TRUE);//将光标移到开头
		m_ctrlfile.SetSel(0,0);//将光标移到末尾
		m_ctrlfile.SetSel(-1);//选中所有内容
		m_ctrlfile.SetSel(0,-1);//写入值

		//m_ctrlfile.ReplaceSel("Position: ");
		m_ctrlfile.ReplaceSel(szFile);
		//m_ctrlfile.ReplaceSel("\r\n");

		UpdateData(TRUE);
		_splitpath(szFile, Drive, Dir, Fname, Ext);
		ptr=strupr(Ext);
		strcpy(Ext, ptr);

		if (strcmp(Ext, ".BIN")==0)
			bRet=LoadBIN(szFile);
		else
		if (strcmp(Ext, ".HEX")==0) 
			bRet=HexFileRead(szFile,Update.Update_Buffer,&Update.UpdateLen);

		if(bRet)
		{
			CString a;
			a.Format("Size: %d byte\r\n", Update.UpdateLen);
			m_output.SetSel(-1);
			m_output.ReplaceSel(a);
			m_output.SetSel(0, 0);
			ChangeFile();
		}
		else{
			::MessageBox(NULL,"Fail to Open File","",MB_OK);  
		}
/*
	    int i;
		FILE *fp = fopen(szFile, "rb");
		if(NULL == fp)     
		{         
			::MessageBox(NULL,"Fail to Open File","",MB_OK);    
		} 
		else
		{
			fseek(fp, 0, SEEK_END);											//把指针移动到文件的结尾 ，获取文件长度					
			Update.UpdateLen = ftell(fp);									//获取文件长度
			rewind(fp);														//把指针移动到文件开头 因为我们一开始把指针移动到结尾，如果不移动回来 会出错	
		
			//int i = fread(Update.Update_Buffer, 1, Update.UpdateLen, fp);	//读文件
			i = fread(Update.Update_Buffer, sizeof(char), Update.UpdateLen, fp);

			fclose(fp);
			fp = NULL;

			CString a;
			a.Format("Size: %d byte\r\n", Update.UpdateLen);
			m_output.SetSel(-1);
			m_output.ReplaceSel(a);
			m_output.SetSel(0, 0);

			//m_Update_Progress.SetRange32(0, (BANK3_WRITE_END_ADDR-BANK1_WRITE_START_ADDR)); 
	       //m_Update_Progress.SetPos(0); 
		}
*/
	}
}


void CSTM32ISPDlg::OnStartKeydowm(WPARAM wParam, LPARAM lParam) 
{

	// TODO: Add your control notification handler code here
	_TCHAR Drive[3], Dir[256], Fname[256], Ext[256];
	_TCHAR *ptr;
	BOOL bRet=FALSE;
	CString str_tmp,sz_val;
	int Length=0;
	UpdateData(TRUE);

	//AfxMessageBox(_T("1....."));

	_splitpath(m_valuefile, Drive, Dir, Fname, Ext);
	ptr=strupr(Ext);
	strcpy(Ext, ptr);

	if (strcmp(Ext, ".BIN")==0)
		bRet=LoadBIN(m_valuefile);
	else
	if (strcmp(Ext, ".HEX")==0) 
		bRet=HexFileRead(m_valuefile,Update.Update_Buffer,&Update.UpdateLen);

	if(bRet)
	{
		CString a;
		a.Format("Size: %d byte\r\n", Update.UpdateLen);
		m_output.SetSel(-1);
		m_output.ReplaceSel(a);
		m_output.SetSel(0, 0);
	}
	else{
		Update.UpdateLen=0;
		m_output.SetSel(-1);
		m_output.ReplaceSel("Fail to Open File! \r\n");
		m_output.SetSel(0, 0);
		return;
	}
	
	//取端口号
	GetDlgItemText(IDC_COMBO_Port,str_tmp);
	Length=str_tmp.GetLength();
	if(Length<5)
	sz_val=str_tmp.Right(str_tmp.Find("COM")+1);
	else if(Length<6)
	sz_val=str_tmp.Right(str_tmp.Find("COM")+2);
	else if(Length<7)
	sz_val=str_tmp.Right(str_tmp.Find("COM")+3);

	Port = atoi(sz_val.GetBuffer(MAX_PATH));

	
	if(m_ctrlbps.GetCurSel())
	{
		My_BpsChoose = 250000L;
	}
	else{
		My_BpsChoose = 115200L;
	}
	//sio_baud ( Port, My_BpsChoose );

	CString a;
	m_myisp.GetDlgItemText(IDC_BUTTON_Start,a);
	
	if(!strcmp(a,"Start"))
	{
		if(SIO_OK!=sio_open(Port))
		{
			m_output.SetSel(-1);
			m_output.ReplaceSel("Error! No This comport Or In using! \r\n");
			m_output.SetSel(0, 0);
		}
		else
		{
			sio_ioctl(Port,B115200,BIT_8 | STOP_1 | P_EVEN);
			if(My_BpsChoose == 250000L)sio_baud ( Port, My_BpsChoose );

			sio_cnt_irq(Port,CntIrq,1);
			m_myisp.SetDlgItemText(IDC_BUTTON_Start,"Stop");

			m_ctrlport.EnableWindow(FALSE); 
			m_ctrlbps.EnableWindow(FALSE);

			Time=0;
			//m_Update_Progress.SetRange32(0, (BANK3_WRITE_END_ADDR-BANK1_WRITE_START_ADDR)); 
			//m_Update_Progress.SetPos(0);

			CString a;
		    a.Format("Status: COM%d Opened %d \r\n",Port,My_BpsChoose);
			m_output.SetSel(0,-1);
			m_output.ReplaceSel(a);
			myiap.Times=0;
			myiap.Writelength=0;
			myiap.ReceiveNum=0;

			SetTimer(1,DownLoad_Time,NULL);//时间为100毫秒

			myiap.SYSstate = SYSIAP_CONNECT;

			m_ctrlprogress.SetRange32(0, Update.UpdateLen); 
			m_ctrlprogress.SetPos(0);

		}
	}
	else 
	{
		KillTimer(1);
		sio_close(Port);

		m_myisp.SetDlgItemText(IDC_BUTTON_Start,"Start");
		m_ctrlport.EnableWindow(TRUE); 
		m_ctrlbps.EnableWindow(TRUE);
		CString a;
		a.Format("\r\nStatus: COM%d Closed \r\n",Port);
	    m_output.SetSel(-1);
		m_output.ReplaceSel(a);

