WIFI-DMX/STM32ISP/STM32ISPDlg.cpp
		Port = -1;
	}	

}

///////////////////////////串口中断回调函数//////////////////////////////////
VOID CALLBACK TxEmptyIrq(int port)
{
	if(::AfxGetMainWnd()) 
	{
		if(::AfxGetMainWnd()->m_hWnd)
		{
			::PostMessage(::AfxGetMainWnd()->m_hWnd,WM_PCOMMSEND,0,0); 
		}
	}
}

VOID CALLBACK CntIrq(int port) 
{
	if(::AfxGetMainWnd()) 
	{
		if(::AfxGetMainWnd()->m_hWnd)
		{
			::PostMessage(::AfxGetMainWnd()->m_hWnd,WM_PCOMM,0,0); 
		}
	}
}

void CSTM32ISPDlg::OnMyInfo(WPARAM pParam,LPARAM IParam)
{
	if(0==pParam)
	{

	}
	else
	{

	}
}

void CSTM32ISPDlg::OnPcomm()
{

	char buf[1024];
	int end=sio_read(Port,buf,1024);
	if(end)
	{
		for(int i=0;i<end;i++)
		{
			FifoIn(&MyFifo,buf[i]);
		}			
	}
	
}
void CSTM32ISPDlg::SendPcomm()
{
	/*
static char i=0;
	sio_putch(Port,i++);
	if(i==0)
*/

}


BYTE CSTM32ISPDlg::STBL_Init_BL()
{	
	volatile unsigned short RX_Buffer[255];
	volatile unsigned char TX_Buffer[255];
	int i;
	static int j=0;
#if Stm32_Enable
	static unsigned char state=0,k=15;
	if(state!=myiap.SYSstate){
		state=myiap.SYSstate;
		//k=k+1;if(k>15)k=0;
		LCM_PrintsTemp(k,0,(unsigned char*)&Number_Isp[(state)% 100 / 10]);
		LCM_PrintsTemp(k,1,(unsigned char*)&Number_Isp[(state)%10]);
	}
#endif	
#if(Print_Enable)
    //CString c;
	//c.Format("State:%02d \r\n",(unsigned char)myiap.SYSstate);
	//m_output.ReplaceSel(c);
#endif
	switch(myiap.SYSstate){
	    case SYSIAP_CONNECT:     
		myiap.Num=0;
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
#if(Print_Enable)
                CString a;
			    a.Format("%02X \r\n",(unsigned char)RX_Buffer[myiap.Num]);
	   	        m_output.ReplaceSel(a);
#endif
				if((RX_Buffer[myiap.Num]==0x79)||(RX_Buffer[myiap.Num]==0x1F)){
					myiap.ReceiveNum++;
					if(myiap.ReceiveNum>3){
						myiap.SYSstate = SYSIAP_Getversion;	
						while(MyFifo.count){FifoOut(&MyFifo,&RX_Buffer[myiap.Num]);}
						myiap.ReceiveNum=0;
					}
					return SUCCESS_IAP;
				}
				else{
					myiap.ReceiveNum=0;
				}
			}
		}
		{
			TX_Buffer[0] = INIT_CON; 
			sio_write(Port,(char*)&TX_Buffer,1);
			myiap.Times++;
#if(Print_Enable)
			CString a;
			m_output.SetSel(20,-1);
			a.Format("\r\nConnectting...%d ",myiap.Times);
	   	    m_output.ReplaceSel(a);
#endif
#if LCD_Enable
	if(myiap.Times%10==0)
	LCM_PrintsTemp(12,3,(unsigned char*)&Number_Isp[((myiap.Times%100)*10)/(100)]);
#endif
		}
		myiap.Timeout=0;
		ISP_Address = StartAddr ;
		break;
		case SYSIAP_Getversion://15
		{
			TX_Buffer[0] = GET_CMD;
			TX_Buffer[1] = ~TX_Buffer[0];
			sio_write(Port,(char*)&TX_Buffer,2);
			myiap.SYSstate = SYSIAP_Getversion_ACK;
			myiap.Num=0;
		}
		case SYSIAP_Getversion_ACK:
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
#if(Print_Enable)
                CString a;
			    a.Format("%02X ",(unsigned char)RX_Buffer[myiap.Num]);
	   	        m_output.ReplaceSel(a);
#endif
				if((RX_Buffer[0]==0x79)&&(RX_Buffer[14]==0x79)){			
					myiap.SYSstate = SYSIAP_Getprotect;
					myiap.Num=0;
					myiap.Timeout=0;
					while(MyFifo.count){FifoOut(&MyFifo,&RX_Buffer[myiap.Num]);}
#if(Print_Enable)
	   	        m_output.ReplaceSel("\r\n");
#endif
					return SUCCESS_IAP;
				}
				else{
				
				}
				myiap.Num++;
			}
		}
		if(myiap.Timeout++>WAIT_Timeout)myiap.SYSstate = SYSIAP_CONNECT;
		break;
		case SYSIAP_Getprotect://5
		{
			TX_Buffer[0] = GET_VER_ROPS_CMD;
			TX_Buffer[1] = ~TX_Buffer[0];
			sio_write(Port,(char*)&TX_Buffer,2);
			myiap.SYSstate = SYSIAP_Getprotect_ACK;
			myiap.Num=0;
		}
		case SYSIAP_Getprotect_ACK:
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
#if(Print_Enable) 
				CString a;
			    a.Format("%02X ",(unsigned char)RX_Buffer[myiap.Num]);
	   	        m_output.ReplaceSel(a);
#endif
				if((RX_Buffer[0]==0x79)&&(RX_Buffer[4]==0x79)){
					myiap.SYSstate = SYSIAP_GetchipID;
					myiap.Num=0;
					myiap.Timeout=0;
					while(MyFifo.count){FifoOut(&MyFifo,&RX_Buffer[myiap.Num]);}
#if(Print_Enable)
	   				CString b;
					b.Format("\r\nBootLoader Version:%d.%d\r\n",((unsigned char)RX_Buffer[1])/16,((unsigned char)RX_Buffer[1])%16);
	   				m_output.ReplaceSel(b);
#endif
					return SUCCESS_IAP;
				}
				else{
				
				}
				myiap.Num++;
			}
		}
		if(myiap.Timeout++>WAIT_Timeout)myiap.SYSstate = SYSIAP_CONNECT;
		break;
		case SYSIAP_GetchipID://5
		{
			TX_Buffer[0] = GET_ID_CMD;
			TX_Buffer[1] = ~TX_Buffer[0];
			sio_write(Port,(char*)&TX_Buffer,2);
			myiap.SYSstate = SYSIAP_GetchipID_ACK;
			myiap.Num=0;
		}
		case SYSIAP_GetchipID_ACK:
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
#if(Print_Enable) 
				CString a;
			    a.Format("%02X ",(unsigned char)RX_Buffer[myiap.Num]);
	   	        m_output.ReplaceSel(a);
#endif
				if((RX_Buffer[0]==0x79)&&(RX_Buffer[4]==0x79)){
					myiap.SYSstate = SYSIAP_READSize_CMD;
					myiap.Num=0;
					myiap.Timeout=0;
					while(MyFifo.count){FifoOut(&MyFifo,&RX_Buffer[myiap.Num]);}
#if(Print_Enable)
	   	            DWORD PID = 0x00000000;
					PID=(((unsigned char)RX_Buffer[2])<<8)|((unsigned char)RX_Buffer[3]);
					CString b;
					b.Format("\r\nChip PID:0x%08x \r\n",PID);
	   				m_output.ReplaceSel(b);
#endif
					return SUCCESS_IAP;
				}
				else{
				
				}
				myiap.Num++;
			}
		}
		if(myiap.Timeout++>WAIT_Timeout)myiap.SYSstate = SYSIAP_CONNECT;
		break;
		case SYSIAP_READSize_CMD://1
		myiap.Num=0;
		{
			TX_Buffer[0] = READ_CMD;
			TX_Buffer[1] = ~TX_Buffer[0];
			sio_write(Port,(char*)&TX_Buffer,2);
			myiap.SYSstate = SYSIAP_READSize_CMD_ACK;
			myiap.Num=0;
		}
		case SYSIAP_READSize_CMD_ACK:
		myiap.Num=0;
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
#if(Print_Enable)
                CString a;
			    a.Format("%02X ",(unsigned char)RX_Buffer[myiap.Num]);
	   	        m_output.ReplaceSel(a);
#endif
				if(RX_Buffer[0]==0x79){
					myiap.SYSstate = SYSIAP_READSize_ADDR;
					myiap.Num=0;
					myiap.Timeout=0;
					while(MyFifo.count){FifoOut(&MyFifo,&RX_Buffer[myiap.Num]);}
#if(Print_Enable)
	   	        m_output.ReplaceSel("\r\n");
#endif					
				    return SUCCESS_IAP;
				}
				else{

#if(Print_Enable)
					m_output.ReplaceSel("Read OptionBytes Fail\r\n");
#endif
					myiap.SYSstate = SYSIAP_SETunprotectREADOUT;
				}				
			}
		}
		if(myiap.Timeout++>WAIT_Timeout)myiap.SYSstate = SYSIAP_CONNECT;
		break;
		case SYSIAP_READSize_ADDR:
		{
			BYTE Checksum = 0x00;
			DWORD Read_address = ADDR_FLASH_SIZE;

            TX_Buffer[0] = (BYTE)((Read_address >> 24) & 0x000000FF); Checksum= Checksum ^ TX_Buffer[0];
			TX_Buffer[1] = (BYTE)((Read_address >> 16) & 0x000000FF); Checksum= Checksum ^ TX_Buffer[1];
			TX_Buffer[2] = (BYTE)((Read_address >> 8 ) & 0x000000FF); Checksum= Checksum ^ TX_Buffer[2];
			TX_Buffer[3] = (BYTE)((Read_address      ) & 0x000000FF); Checksum= Checksum ^ TX_Buffer[3];
			TX_Buffer[4] = Checksum;

			sio_write(Port,(char*)&TX_Buffer,5);
			myiap.SYSstate = SYSIAP_READSize_ADDR_ACK;
			myiap.Num=0;
		}
		case SYSIAP_READSize_ADDR_ACK:
		myiap.Num=0;
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
#if(Print_Enable)
                CString a;
			    a.Format("%02X ",(unsigned char)RX_Buffer[myiap.Num]);
	   	        m_output.ReplaceSel(a);
#endif
				if(RX_Buffer[0]==0x79){
					myiap.SYSstate = SYSIAP_READSize_Num;
					myiap.Num=0;
					myiap.Timeout=0;
					while(MyFifo.count){FifoOut(&MyFifo,&RX_Buffer[myiap.Num]);}
#if(Print_Enable)
					m_output.ReplaceSel("\r\n");
#endif
					return SUCCESS_IAP;
				}
				else{
#if(Print_Enable)
					m_output.ReplaceSel("Read OptionBytes Fail\r\n");
#endif
					myiap.SYSstate = SYSIAP_CONNECT;
				}				
			}
		}
		if(myiap.Timeout++>WAIT_Timeout)myiap.SYSstate = SYSIAP_CONNECT;
		break;
		case SYSIAP_READSize_Num:	
		{
			BYTE Read_length = 20;

			// send data size to be read
			TX_Buffer[0] = Read_length-1;
			TX_Buffer[1] = ~(Read_length-1);

