WIFI-DMX/STM32ISP/STM32ISPDlg.cpp
			sio_write(Port,(char*)&TX_Buffer,2);
			myiap.SYSstate = SYSIAP_READSize_Num_ACK;
			myiap.Num=0;
		}
		case SYSIAP_READSize_Num_ACK:
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
#if(Print_Enable)
                CString a;
			    a.Format("%02X ",(unsigned char)RX_Buffer[myiap.Num]);
	   	        m_output.ReplaceSel(a);
#endif
				if((RX_Buffer[0]==0x79)&&(myiap.Num>=20)){
					myiap.SYSstate = SYSIAP_READ_CMD;
					myiap.Num=0;
					myiap.Timeout=0;				
					FlashSize=((unsigned char)RX_Buffer[1])|(((unsigned char)RX_Buffer[2])<<8);
					if((unsigned int)Update.UpdateLen>FlashSize*1024)myiap.SYSstate = SYSIAP_WRITE_STOP;
#if(Print_Enable)
					CString b;
					b.Format("\r\nFlash Size:%dKB \r\n",FlashSize);
	   				m_output.ReplaceSel(b);
#endif
					while(MyFifo.count){FifoOut(&MyFifo,&RX_Buffer[myiap.Num]);}
					return SUCCESS_IAP;
				}
				else{
					//myiap.SYSstate = SYSIAP_CONNECT;
				}				
			}
		    myiap.Num++;
		}
		if(myiap.Timeout++>WAIT_Timeout)myiap.SYSstate = SYSIAP_CONNECT;
		break;
		case SYSIAP_READ_CMD://1
		myiap.Num=0;
		{
			TX_Buffer[0] = READ_CMD;
			TX_Buffer[1] = ~TX_Buffer[0];
			sio_write(Port,(char*)&TX_Buffer,2);
			myiap.SYSstate = SYSIAP_READ_CMD_ACK;
			myiap.Num=0;
		}
		case SYSIAP_READ_CMD_ACK:
		myiap.Num=0;
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
#if(Print_Enable)
                CString a;
			    a.Format("%02X ",(unsigned char)RX_Buffer[myiap.Num]);
	   	        m_output.ReplaceSel(a);
#endif
				if(RX_Buffer[0]==0x79){
					myiap.SYSstate = SYSIAP_READ_ADDR;
					myiap.Num=0;
					myiap.Timeout=0;
					while(MyFifo.count){FifoOut(&MyFifo,&RX_Buffer[myiap.Num]);}
#if(Print_Enable)
	   	        m_output.ReplaceSel("\r\n");
#endif					
				    return SUCCESS_IAP;
				}
				else{

#if(Print_Enable)
					m_output.ReplaceSel("Read OptionBytes Fail\r\n");
#endif
					myiap.SYSstate = SYSIAP_SETunprotectREADOUT;
				}				
			}
		}
		if(myiap.Timeout++>WAIT_Timeout)myiap.SYSstate = SYSIAP_CONNECT;
		break;
		case SYSIAP_READ_ADDR:
		{
			BYTE Checksum = 0x00;
			DWORD Read_address = 0x1FFFF800;

            TX_Buffer[0] = (BYTE)((Read_address >> 24) & 0x000000FF); Checksum= Checksum ^ TX_Buffer[0];
			TX_Buffer[1] = (BYTE)((Read_address >> 16) & 0x000000FF); Checksum= Checksum ^ TX_Buffer[1];
			TX_Buffer[2] = (BYTE)((Read_address >> 8 ) & 0x000000FF); Checksum= Checksum ^ TX_Buffer[2];
			TX_Buffer[3] = (BYTE)((Read_address      ) & 0x000000FF); Checksum= Checksum ^ TX_Buffer[3];
			TX_Buffer[4] = Checksum;

			sio_write(Port,(char*)&TX_Buffer,5);
			myiap.SYSstate = SYSIAP_READ_ADDR_ACK;
			myiap.Num=0;
		}
		case SYSIAP_READ_ADDR_ACK:
		myiap.Num=0;
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
#if(Print_Enable)
                CString a;
			    a.Format("%02X ",(unsigned char)RX_Buffer[myiap.Num]);
	   	        m_output.ReplaceSel(a);
#endif
				if(RX_Buffer[0]==0x79){
					myiap.SYSstate = SYSIAP_READ_Num;
					myiap.Num=0;
					myiap.Timeout=0;
					while(MyFifo.count){FifoOut(&MyFifo,&RX_Buffer[myiap.Num]);}
#if(Print_Enable)
					m_output.ReplaceSel("\r\n");
#endif
					return SUCCESS_IAP;
				}
				else{
#if(Print_Enable)
					m_output.ReplaceSel("Read OptionBytes Fail\r\n");
#endif
					myiap.SYSstate = SYSIAP_CONNECT;
				}				
			}
		}
		if(myiap.Timeout++>WAIT_Timeout)myiap.SYSstate = SYSIAP_CONNECT;
		break;
		case SYSIAP_READ_Num:	
		{
			BYTE Read_length = 16;

			// send data size to be read
			TX_Buffer[0] = Read_length-1;
			TX_Buffer[1] = ~(Read_length-1);

			sio_write(Port,(char*)&TX_Buffer,2);
			myiap.SYSstate = SYSIAP_READ_Num_ACK;
			myiap.Num=0;
		}
		case SYSIAP_READ_Num_ACK:
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
#if(Print_Enable)
                CString a;
			    a.Format("%02X ",(unsigned char)RX_Buffer[myiap.Num]);
	   	        m_output.ReplaceSel(a);
#endif
				if((RX_Buffer[0]==0x79)&&(myiap.Num>=16)){
					myiap.SYSstate = SYSIAP_ERASE_CMD;
					myiap.Num=0;
					myiap.Timeout=0;
					while(MyFifo.count){FifoOut(&MyFifo,&RX_Buffer[myiap.Num]);}
#if(Print_Enable)
					m_output.ReplaceSel("\r\n");
#endif
					return SUCCESS_IAP;
				}
				else{
				
				}				
			}
		    myiap.Num++;
		}
		if(myiap.Timeout++>WAIT_Timeout)myiap.SYSstate = SYSIAP_CONNECT;
		break;
		case SYSIAP_SETunprotectWrite:
		{
			TX_Buffer[0] = WRITE_TEMP_UNPROTECT_CMD;
			TX_Buffer[1] = ~TX_Buffer[0];
			sio_write(Port,(char*)&TX_Buffer,2);
			myiap.SYSstate = SYSIAP_SETunprotectWrite_ACK;
			myiap.Num=0;
		}
		case SYSIAP_SETunprotectWrite_ACK:
		myiap.Num=0;
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
#if(Print_Enable)
                CString a;
			    a.Format("%02X ",(unsigned char)RX_Buffer[myiap.Num]);
	   	        m_output.ReplaceSel(a);
#endif
				if((RX_Buffer[0]==0x79)&&(RX_Buffer[1]==0x79)){
					myiap.SYSstate = SYSIAP_CONNECT;
					myiap.Num=0;
					myiap.Timeout=0;
					while(MyFifo.count){FifoOut(&MyFifo,&RX_Buffer[myiap.Num]);}
#if(Print_Enable)
					m_output.ReplaceSel("\r\n");
#endif
					return SUCCESS_IAP;
				}
				else{
				}				
			}
			myiap.Num++;
		}
		if(myiap.Timeout++>WAIT_Timeout)myiap.SYSstate = SYSIAP_CONNECT;
		break;
		case SYSIAP_SETunprotectREADOUT:	
		{
			TX_Buffer[0] = READOUT_PERM_UNPROTECT_CMD;
			TX_Buffer[1] = ~TX_Buffer[0];
			sio_write(Port,(char*)&TX_Buffer,2);
			myiap.Timeout=0;
			myiap.SYSstate=SYSIAP_SETunprotectREADOUT_ACK;
			myiap.Num=0;
		}
		case SYSIAP_SETunprotectREADOUT_ACK:
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
#if(Print_Enable) 
				CString a;
			    a.Format("%02X ",(unsigned char)RX_Buffer[myiap.Num]);
	   	        m_output.ReplaceSel(a);
#endif
				if((RX_Buffer[0]==0x79)&&(RX_Buffer[1]==0x79)){
					myiap.SYSstate = SYSIAP_CONNECT;
					myiap.Num=0;
					myiap.Timeout=0;
					while(MyFifo.count){FifoOut(&MyFifo,&RX_Buffer[myiap.Num]);}
#if(Print_Enable)
					m_output.ReplaceSel("Read unprotect Succeed\r\n");
#endif
					return SUCCESS_IAP;
				}
				else{
				}				
			}
			myiap.Num++;
		}
		if(myiap.Timeout++>WAIT_Timeout)myiap.SYSstate = SYSIAP_CONNECT;
		break;
		case SYSIAP_ERASE_CMD:		
		{
			TX_Buffer[0] = ERASE_CMD;
			TX_Buffer[1] = ~TX_Buffer[0];
			sio_write(Port,(char*)&TX_Buffer,2);
			myiap.SYSstate = SYSIAP_ERASE_CMD_ACK;
			myiap.Num=0;
		}
		case SYSIAP_ERASE_CMD_ACK:
		myiap.Num=0;
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
#if(Print_Enable)
                CString a;
			    a.Format("%02X ",(unsigned char)RX_Buffer[myiap.Num]);
	   	        m_output.ReplaceSel(a);
#endif
				if(RX_Buffer[0]==0x79){
					myiap.SYSstate = SYSIAP_ERASE_ALL;
					myiap.Num=0;
					myiap.Timeout=0;
					while(MyFifo.count){FifoOut(&MyFifo,&RX_Buffer[myiap.Num]);}
#if(Print_Enable)
					m_output.ReplaceSel("\r\n");
#endif
					return SUCCESS_IAP;
				}
				else{
#if(Print_Enable)
					m_output.ReplaceSel("Erase Fail\r\n");
#endif
					myiap.SYSstate = SYSIAP_CONNECT;
				}				
			}
		}
		if(myiap.Timeout++>WAIT_Timeout)myiap.SYSstate = SYSIAP_CONNECT;
		break;
		case SYSIAP_ERASE_ALL:		
		{
			TX_Buffer[0] = 0xFF;
			TX_Buffer[1] = ~TX_Buffer[0];
			sio_write(Port,(char*)&TX_Buffer,2);		
			myiap.SYSstate=SYSIAP_ERASE_ALL_ACK;
			myiap.Num=0;
		}
		case SYSIAP_ERASE_ALL_ACK:
		myiap.Num=0;
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
#if(Print_Enable) 
				CString a;
			    a.Format("%02X ",(unsigned char)RX_Buffer[myiap.Num]);
	   	        m_output.ReplaceSel(a);
#endif
				if(RX_Buffer[0]==0x79){
					myiap.SYSstate = SYSIAP_WRITE_CMD;
					myiap.Num=0;
					myiap.Timeout=0;
					while(MyFifo.count){FifoOut(&MyFifo,&RX_Buffer[myiap.Num]);}
#if(Print_Enable) 
					m_output.ReplaceSel("\r\n");
#endif
					SetTimer(1,1,NULL);
					return SUCCESS_IAP;
				}
				else{
#if(Print_Enable) 
					m_output.ReplaceSel("Erase all Fail\r\n");
#endif
					myiap.SYSstate = SYSIAP_CONNECT;
				}				
			}
		}
		if(myiap.Timeout++>WAIT_Timeout)myiap.SYSstate = SYSIAP_CONNECT;
		break;
////////////////////////////////////////////////////////////////////////////////////////////////
		case SYSIAP_WRITE_CMD:
		myiap.Num=0;
		{
			TX_Buffer[0] = WRITE_CMD;
			TX_Buffer[1] = ~TX_Buffer[0];
			sio_write(Port,(char*)&TX_Buffer,2);
			myiap.SYSstate = SYSIAP_WRITE_CMD_ACK;
			myiap.Num=0;
		}
		case SYSIAP_WRITE_CMD_ACK:
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
				if(RX_Buffer[0]==0x79){
					myiap.SYSstate = SYSIAP_WRITE_ADDR;
					myiap.Num=0;
					myiap.Timeout=0;
					//SetTimer(1,DownLoad_Time,NULL);
					return SUCCESS_IAP;
				}
				else{
					myiap.SYSstate = SYSIAP_CONNECT;
					SetTimer(1,DownLoad_Time,NULL);
					return ERROR_OFFSET;
				}				
			}
		}
		if(myiap.Timeout++>WAIT_Timeout){myiap.SYSstate = SYSIAP_CONNECT;SetTimer(1,DownLoad_Time,NULL);return ERROR_OFFSET;}
		break;
		case SYSIAP_WRITE_ADDR:
		myiap.Num=0;
		{
			int Checksum = 0x00;
			DWORD Write_address = 0x08000000+(WRITE_PAGENUM*myiap.Writelength);

            TX_Buffer[0] = (BYTE)((Write_address >> 24) & 0x000000FF); Checksum= Checksum ^ TX_Buffer[0];
			TX_Buffer[1] = (BYTE)((Write_address >> 16) & 0x000000FF); Checksum= Checksum ^ TX_Buffer[1];
			TX_Buffer[2] = (BYTE)((Write_address >> 8 ) & 0x000000FF); Checksum= Checksum ^ TX_Buffer[2];
			TX_Buffer[3] = (BYTE)((Write_address      ) & 0x000000FF); Checksum= Checksum ^ TX_Buffer[3];
			TX_Buffer[4] = Checksum;

			sio_write(Port,(char*)&TX_Buffer,5);
			myiap.SYSstate = SYSIAP_WRITE_ADDR_ACK;
			myiap.Num=0;
		}
		case SYSIAP_WRITE_ADDR_ACK:
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
#if(Print_Enable) 
				if(myiap.Writelength%8==0)
				{
					CString a;
					a.Format("%02X %X \r\n",(unsigned char)RX_Buffer[myiap.Num],0x08000000+(WRITE_PAGENUM*myiap.Writelength));
	   				m_output.ReplaceSel(a);
				}
#endif
				if(RX_Buffer[0]==0x79){
					myiap.SYSstate = SYSIAP_WRITE_DATA;
					myiap.Num=0;
					myiap.Timeout=0;
					//SetTimer(1,DownLoad_Time,NULL);
					return SUCCESS_IAP;
				}
				else{
					SetTimer(1,DownLoad_Time,NULL);
					myiap.SYSstate = SYSIAP_CONNECT;
				}				
			}
		}
		if(myiap.Timeout++>WAIT_Timeout){myiap.SYSstate = SYSIAP_CONNECT;SetTimer(1,DownLoad_Time,NULL);return ERROR_OFFSET;}
		break;
		case SYSIAP_WRITE_DATA:
		{
			int Checksum = 0x00;
			int Write_length = WRITE_PAGENUM;

			if((myiap.Writelength+1)*WRITE_PAGENUM>(unsigned int)Update.UpdateLen){
				Write_length = (((myiap.Writelength+1)*WRITE_PAGENUM-Update.UpdateLen*4/4));
				if(WRITE_PAGENUM > Write_length)Write_length = WRITE_PAGENUM - Write_length;
#if(Print_Enable) 
				CString a;
			    a.Format("length:%d ",Write_length);
	   	        m_output.ReplaceSel(a);
#endif
			}

