WIFI-DMX/STM32ISP/STM32ISPDlg.cpp
            TX_Buffer[0] = Write_length-1; Checksum = TX_Buffer[0];
#if(Stm32_Enable)
			for (i = 0; i< Write_length; i=i+4){
				
                TX_Buffer[i+1]=(uint8_t)((*(__IO uint32_t*) ISP_Address)>>0);
				Checksum = Checksum ^TX_Buffer[i+1]; 
				TX_Buffer[i+2]=(uint8_t)((*(__IO uint32_t*) ISP_Address)>>8);
				Checksum = Checksum ^TX_Buffer[i+2]; 
				TX_Buffer[i+3]=(uint8_t)((*(__IO uint32_t*) ISP_Address)>>16);
				Checksum = Checksum ^TX_Buffer[i+3]; 
				TX_Buffer[i+4]=(uint8_t)((*(__IO uint32_t*) ISP_Address)>>24);
				Checksum = Checksum ^TX_Buffer[i+4]; 
				ISP_Address	=ISP_Address+4;
			}
	#if LCD_Enable
			if(ISP_Address%FLASH_PAGE_SIZE==0)LCM_Frame(((ISP_Address-StartAddr)*100)/(EndAddr-StartAddr));
	#endif
#else
			for (i = 0; i< Write_length; i++){
				Checksum = Checksum ^ Update.Update_Buffer[(myiap.Writelength*WRITE_PAGENUM)+i];//Update.UpdateLen
                TX_Buffer[i+1]=Update.Update_Buffer[(myiap.Writelength*WRITE_PAGENUM)+i];
			
			}
#endif
			TX_Buffer[Write_length+1] = Checksum;

			sio_write(Port,(char*)&TX_Buffer,Write_length+2);
#if(Print_Enable) 
			m_ctrlprogress.SetPos((myiap.Writelength+1)*WRITE_PAGENUM);
#endif
			myiap.SYSstate = SYSIAP_WRITE_DATA_ACK;
			myiap.Num=0;
		}
		case SYSIAP_WRITE_DATA_ACK:
		myiap.Num=0;
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
				if(RX_Buffer[0]==0x79){
					myiap.Writelength++;
					if(myiap.Writelength*WRITE_PAGENUM > (unsigned int)Update.UpdateLen){
						if(Go_Run){
							myiap.SYSstate = SYSIAP_GO_CMD;
						}
						else{
							myiap.SYSstate = SYSIAP_WRITE_FINISH;
						}
									
						SetTimer(1,DownLoad_Time,NULL);
					}
					else{
					    myiap.SYSstate = SYSIAP_WRITE_CMD;
					}
					myiap.Timeout=0;
					myiap.Num=0;				
					return SUCCESS_IAP;
				}
				else{
					SetTimer(1,DownLoad_Time,NULL);
					myiap.SYSstate = SYSIAP_CONNECT;
				}				
			}
		}
		if(myiap.Timeout++>WAIT_Timeout)myiap.SYSstate = SYSIAP_CONNECT;
		break;
		case SYSIAP_GO_CMD:
		myiap.Num=0;
		{
			TX_Buffer[0] = GO_CMD;
			TX_Buffer[1] = ~TX_Buffer[0];
			sio_write(Port,(char*)&TX_Buffer,2);
			myiap.SYSstate = SYSIAP_GO_CMD_ACK;
			myiap.Num=0;
		}
		case SYSIAP_GO_CMD_ACK:
		while(MyFifo.count){
			if(FifoOut(&MyFifo,&RX_Buffer[myiap.Num])==FifoNormal){
				if(RX_Buffer[0]==0x79){
					myiap.SYSstate = SYSIAP_GO_ADDR;
					myiap.Num=0;
					myiap.Timeout=0;
					//SetTimer(1,DownLoad_Time,NULL);
					return SUCCESS_IAP;
				}
				else{
					myiap.SYSstate = SYSIAP_GO_ADDR;
					SetTimer(1,DownLoad_Time,NULL);
					return ERROR_OFFSET;
				}				
			}
		}
		if(myiap.Timeout++>WAIT_Timeout){myiap.SYSstate = SYSIAP_GO_ADDR;SetTimer(1,DownLoad_Time,NULL);return ERROR_OFFSET;}
		break;
		case SYSIAP_GO_ADDR:
		myiap.Num=0;
		{
			int Checksum = 0x00;
			DWORD Go_address = 0x08000000;

            TX_Buffer[0] = (BYTE)((Go_address >> 24) & 0x000000FF); Checksum= Checksum ^ TX_Buffer[0];
			TX_Buffer[1] = (BYTE)((Go_address >> 16) & 0x000000FF); Checksum= Checksum ^ TX_Buffer[1];
			TX_Buffer[2] = (BYTE)((Go_address >> 8 ) & 0x000000FF); Checksum= Checksum ^ TX_Buffer[2];
			TX_Buffer[3] = (BYTE)((Go_address      ) & 0x000000FF); Checksum= Checksum ^ TX_Buffer[3];
			TX_Buffer[4] = Checksum;

			sio_write(Port,(char*)&TX_Buffer,5);
			myiap.SYSstate = SYSIAP_GO_ADDR_ACK;
			myiap.Num=0;
		}
		case SYSIAP_GO_ADDR_ACK:
			myiap.SYSstate = SYSIAP_WRITE_FINISH;
		break;
		case SYSIAP_WRITE_FINISH:
#if(Print_Enable) 
			m_output.ReplaceSel("Write data Finish \r\n");
#endif
#if LCD_Enable
			LCM_Frame(100);	
			LCM_Prints(10,1,"OK");
#endif	
            myiap.SYSstate = SYSIAP_WRITE_STOP;
			myiap.Timeout=0;
		break;
		case SYSIAP_WRITE_STOP:
		OnStartKeydowm(0,0);
		break;
		default:break;
	}
#if Stm32_Enable
    if(j++%10==0){LED4_Port->ODR ^= LED4_Pin;}
#endif	 
	return UNREOGNIZED_DEVICE;
}



BOOL CSTM32ISPDlg::LoadBIN(CString pFilePath)
{
	CFile File;
    CFileException ex;
	if (File.Open(/*(LPCSTR)*/pFilePath, CFile::modeRead, &ex))
	{
		IMAGEELEMENT Element;
		Element.dwDataLength=File.SeekToEnd();
		File.SeekToBegin();

		Element.dwAddress = 0x08000000;
		Element.Data=new BYTE[Element.dwDataLength];
		//File.Read(Element.Data, Element.dwDataLength);
		Update.UpdateLen= Element.dwDataLength;
		File.Read(Update.Update_Buffer, Update.UpdateLen);
		File.Close();
		/*
		if (!SetImageElement(0, TRUE, Element))
		{
			AfxMessageBox("Unable to insert element in the image...");
			return FALSE;
		}
		*/
		free(Element.Data);
	}
	else return FALSE;

	return TRUE;
}

BOOL CSTM32ISPDlg::LoadHEX(CString pFilePath)
{
	IMAGEELEMENT Element;//, *pPrevElement;
	BOOL bRet= TRUE ;
	FILE *fp;
//	BOOL bConcatenate;
	Update.UpdateLen=0;

	fp = _tfopen(pFilePath, _T("r"));
	if (!fp)
		bRet=FALSE;
	else
	{
		unsigned long target_address=0,                 /* address of array index */
					  base_address=0,
					  extended_address=0,
					  address=0,                        /* offset/address from hexfile */
					  i=0,                              /* counterindex */
					  checksum=0,                       /* checksum from hexfile */
					  byte_count=0,                     /* bytes per line in hexfile */
					  sum_var=0;                        /* to calculate checksum */
		              
		unsigned long separator='0',                    /* separator string in hexfile */
					  character='0',                    /* date from hexfile */
					  colon ='0';                       /* begin of line in hexfile */
		unsigned short lineno=0;
		BOOL last_byte = FALSE;						    /* conversion  end/begin */

		//UNICODE char message[255];		// error message
		CString message;


		do {
			sum_var = 0;                          /* checksum calculation begin */
			fscanf(fp,"%1c",&colon);
			//fscanf_s(fp, "%1c", &colon, sizeof(colon));
			if (feof(fp))  { // Detect End Of File & Exit if S9 or S8 or S7 record not found
				last_byte = TRUE;
			}
			else 
			if (colon == ':') {                   /* do only if intel hexfile */			
				fscanf(fp,"%2x",&byte_count);
				//fscanf_s(fp, "%2x", &byte_count, sizeof(byte_count));
				sum_var += byte_count;
				fscanf(fp,"%4x",&address);
				//fscanf_s(fp, "%4x", &address, sizeof(address));
				fscanf(fp,"%2x",&separator);
				//fscanf_s(fp, "%2x", &separator, sizeof(separator));
				if (separator== 0x00)
				{		
					//if(byte_count!=12)Update.UpdateLen=byte_count;
					target_address = (extended_address<<16) + (base_address<<4) + address;
					sum_var = sum_var + (address >> 8) + (address % 256);
					Element.dwAddress=target_address;
					Element.dwDataLength=byte_count;
					Element.Data=(PBYTE)malloc(Element.dwDataLength);
					for (i=0; i < byte_count; i++) {
						fscanf(fp,"%2x",&character);
						//fscanf_s(fp,"%2x",&character, sizeof(character));
						sum_var += character;
						Element.Data[i] = (unsigned char)character;
						Update.Update_Buffer[Update.UpdateLen++]= (unsigned char)character;
					}
					sum_var += separator;
					fscanf(fp,"%2x",&checksum);
					//fscanf_s(fp,"%2x",&checksum, sizeof(checksum));
					sum_var = (sum_var % 256);
					if (((checksum + sum_var) % 256) != 0) {
						free(Element.Data);
						//UNICODE wsprintf(message, "FILE : line %i: Bad hexadecimal checksum!", lineno);
						message.Format(_T("FILE : line %i: Bad hexadecimal checksum!"), lineno);
						LDisplayError(message);
						bRet=FALSE;
						//break;
					}
					// The Element is correct. Check if this element is contiguous with this one. In this case we'll not
					// create a new element but concatenate data
					/*
					bConcatenate=FALSE;
					if (GetNbElements()!=0)
					{
						pPrevElement=(PIMAGEELEMENT)m_pElements->GetAt(GetNbElements()-1);
						if (pPrevElement->dwAddress+pPrevElement->dwDataLength==Element.dwAddress)
							bConcatenate=TRUE;
						else
							bConcatenate=FALSE;
					}
					
					if (!bConcatenate)
						SetImageElement(GetNbElements(), TRUE, Element);
					else
					{
						pPrevElement->Data=(PBYTE)realloc(pPrevElement->Data, pPrevElement->dwDataLength+Element.dwDataLength);
						memcpy(pPrevElement->Data+pPrevElement->dwDataLength, Element.Data, Element.dwDataLength);
						pPrevElement->dwDataLength=pPrevElement->dwDataLength+Element.dwDataLength;
					}
					*/
					free(Element.Data);
				}
				else
				if (separator== 0x01)
				{
					sum_var = sum_var + (address >> 8) + (address % 256) + separator;
					sum_var = (sum_var % 256);
					fscanf(fp,"%2x",&checksum);
					//fscanf_s(fp,"%2x",&checksum, sizeof(checksum));
					if (((checksum + sum_var) % 256) != 0) {
						//UNICODE wsprintf(message, "FILE : line %i: Bad hexadecimal checksum!", lineno);
						message.Format(_T("FILE : line %i: Bad hexadecimal checksum!"), lineno);
						LDisplayError(message);
						bRet=FALSE;
						break;
					}
					else {
						last_byte = TRUE;         /* eof */
					}
				}
				else
				if (separator==0x02)
				{
					fscanf(fp,"%4x",&base_address);
					//fscanf_s(fp,"%4x",&base_address,sizeof(base_address));
					fscanf(fp,"%2x",&checksum);
					//fscanf_s(fp, "%2x", &checksum, sizeof(checksum));
					sum_var = sum_var + (address >> 8) + (address % 256) + separator \
									  + (base_address >> 8) + (base_address % 256);
					sum_var = (sum_var % 256);
					if (((checksum + sum_var) % 256) != 0) {
						//wsprintf(message, "FILE : line %i: Bad hexadecimal checksum!", lineno);
						message.Format(_T("FILE : line %i: Bad hexadecimal checksum!"), lineno);
						LDisplayError(message);
						bRet=FALSE;
						break;
					}
				}
				else
				if (separator==0x03)
				{
					sum_var = sum_var + (address >> 8) + (address % 256) + separator;
					for (i=0; i < byte_count; i++) {
						fscanf(fp,"%2x",&character);
						//fscanf_s(fp, "%2x", &character, sizeof(character));
						sum_var += character;
					}
					fscanf(fp, "%2x", &checksum);
					//fscanf_s(fp, "%2x", &checksum, sizeof(checksum));
					sum_var = (sum_var % 256);
					if (((checksum + sum_var) % 256) != 0) {
						//wsprintf(message, "FILE : line %i: Bad hexadecimal checksum!", lineno);
						message.Format(_T("FILE : line %i: Bad hexadecimal checksum!"), lineno);
						LDisplayError(message);
						bRet=FALSE;
						break;
					}
				}
				else
				if (separator==0x04)
				{
					fscanf(fp, "%4x", &extended_address);
					//fscanf_s(fp, "%4x", &extended_address, sizeof (extended_address));
					fscanf(fp,"%2x",&checksum);
					//fscanf_s(fp,"%2x",&checksum,sizeof (checksum));
					sum_var = sum_var + (address >> 8) + (address % 256) + separator \
							 + (extended_address >> 8) + (extended_address % 256);
					sum_var = (sum_var % 256);
					if (((checksum + sum_var) % 256) != 0) {
						//wsprintf(message, "FILE : line %i: Bad hexadecimal checksum!", lineno);
						message.Format(_T("FILE : line %i: Bad hexadecimal checksum!"), lineno);
						LDisplayError(message);
						bRet=FALSE;
						break;
					}
				}
				else
				if (separator==0x05)
				{
					sum_var = sum_var + (address >> 8) + (address % 256) + separator;
					for (i=0; i < byte_count; i++) {
						fscanf(fp,"%2x",&character);
						//fscanf_s(fp, "%2x", &character, sizeof(character));
						sum_var += character;
					}
					fscanf(fp, "%2x", &checksum);
					//fscanf_s(fp, "%2x", &checksum, sizeof(checksum));
					sum_var = (sum_var % 256);
					if (((checksum + sum_var) % 256) != 0) {
						//wsprintf(message, "FILE : line %i: Bad hexadecimal checksum!", lineno);
						message.Format(_T("FILE : line %i: Bad hexadecimal checksum!"), lineno);
						LDisplayError(message);
						bRet=FALSE;
						break;
					}
				}
				else
				{
					//wsprintf(message, "FILE : line %i: Not in Intel Hex format!", lineno);
					message.Format(_T("FILE : line %i: Not in Intel Hex format!"), lineno);
				    LDisplayError(message);
					bRet=FALSE;
					break;
				}
			}
			else if ((colon == '\r') || (colon == '\n')) { // Skip CR:0x0D & LF:0x0A Characters
				lineno++; // increment number of line
				if (feof(fp))  { // Detect End Of File & Exit if last record not found
					last_byte = TRUE;         /* eof */
				}
			}
			else if (colon == ' ') { // Skip Space ' ' Characters
				if (feof(fp))  { // Detect End Of File & Exit if last record not found
					last_byte = TRUE;         /* eof */
				}
			}
			else {
				//wsprintf(message, "FILE : line %i: Not in Intel Hex format!", lineno);
				message.Format(_T("FILE : line %i: Not in Intel Hex format!"), lineno);
				LDisplayError(message);
				bRet=FALSE;
				break;
			}
		}
		while (!last_byte);

		fclose(fp);
	}

	//if (bRet)
	//	CompactElements();

