WIFI-DMX/STM32ISP/STM32ISPDlg.cpp
	return bRet;
}

//------------------------------------------------------------------------------
//     * 00 - Data record
//     * 01 - End of file record
//     * 02 - Extended segment address record
//     * 03 - Start segment address record
//     * 04 - Extended linear address record
//     * 05 - Start linear address record
//------------------------------------------------------------------------------

BOOL HexFileRead(const char *filename, void* lpBuffer,int*UpdateLen)
{
	char FileLine[1024];
	char Codedata;
	char* CodeAddr;
	char FirstBassState=0,FirstStartState=0;
	int  FirstBassAddress=0,FirstStartAddr=0;
	unsigned char sun=0,check=0;
	int  iByteCount,iStartAddr,iRecordType,i,BassAddress=0;
	
	FILE *file;
	file = fopen(filename,"r");
	CodeAddr=(char*)lpBuffer;

	while(!feof(file))//检测文件结束符号
	{
		//: + 长度 + 地址 + 类型 + N个数据(N >= 0) + 校验
		//1 + 2    + 4    + 2    + N * 2           + 2
		fscanf(file,"%1c%2x%4x%2x",&Codedata,&iByteCount,&iStartAddr,&iRecordType);
		if(Codedata!=':')
		{
			fscanf(file,"%s\r\n",FileLine);
			continue;
		}

		if(iRecordType==0)
		{
			sun=iByteCount+(unsigned char)iStartAddr+(unsigned char)(iStartAddr>>8)+iRecordType;
			if(FirstStartState==0){FirstStartAddr=iStartAddr;FirstStartState+=1;}//首次记录
			if(iByteCount==0)
			{
				fscanf(file,"%s\r\n",FileLine);
				break;
			}
			for(i=0;i<iByteCount;i++)
			{
				fscanf(file,"%2x",&Codedata);
				*(CodeAddr + iStartAddr + i + BassAddress-FirstStartAddr) = Codedata;
				sun+=Codedata;
			}
			*UpdateLen=(iStartAddr+iByteCount+BassAddress-FirstStartAddr);
			fscanf(file,"%2x\r\n",&check);
			if((unsigned char)check!=(unsigned char)(0x100-sun))
			{
				fclose(file);
				return FALSE;
			}
			sun=0;
		}
		else if(iRecordType==1)  //End of File
		{
			fclose(file);
			return TRUE;
		}
		else if(iRecordType==2) // base address
		{
			if(FirstBassState==0)
			{
				fscanf(file,"%4x",&FirstBassAddress);
				FirstBassAddress <<= 16;
				FirstBassState=1;
			}
			else{
				FirstBassState=2;
				fscanf(file,"%4x",&BassAddress);
				BassAddress <<= 16;
				BassAddress=BassAddress-FirstBassAddress;
			}
			
			fscanf(file,"%s\r\n",FileLine);
			continue;
		}
		else if(iRecordType==4) // upper address
		{
			if(FirstBassState==0)
			{
				fscanf(file,"%4x",&FirstBassAddress);
				FirstBassAddress <<= 16;
				FirstBassState=1;
			}
			else
			{
				fscanf(file,"%4x",&BassAddress);
				BassAddress <<= 16;
				FirstBassState=2;
				BassAddress=BassAddress-FirstBassAddress;
			}
			
			fscanf(file,"%s\r\n",FileLine);
			continue;
		}
		else if(iRecordType==3) // nothing to do
		{
			fscanf(file,"%s\r\n",FileLine);
			continue;
		}
		else
		{
			fclose(file);
			return FALSE;
		}
	}
	fclose(file);
	return FALSE;
}

BOOL HexFileSave(const char *filename, void* lpBuffer, DWORD dwCount)
{
	CFile OutFile(filename,CFile::modeWrite|CFile::modeCreate);
	
	char* DataRead;
	DataRead = (char*)lpBuffer;
	BYTE VerifyCode=0;
	BYTE Code;
	CString str;
	CString strData = "";
	
	if(dwCount > 0x10000) //for max address over 0xFFFF
	{
		strData += ":020000040000FA\r\n";
	}
	for(DWORD i=0;i<dwCount;i+=0x20)
	{
		strData += ":20";       //line start
		str.Format("%.*X",4,i); //2 bytes start address
		strData += str;
		strData += "00";        //record type
		VerifyCode = 0x20 + (BYTE)(i>>8) + (BYTE)(i);
		for(BYTE j=0;j<0x20;j++)
		{
			Code=(BYTE)*(DataRead+i+j);
			str.Format("%.*X",2,Code);
			strData += str;
			VerifyCode += Code;
		}
		str.Format("%.*X",2,(BYTE)((~VerifyCode)+1));
		strData += str;
		strData += "\r\n";
		if(i==0xFFE0)  //for max address over 0xFFFF
		{
			strData += ":020000040001F9\r\n";
		}
	}
	strData += ":00000001FF";
	OutFile.Write(strData,strData.GetLength());
	OutFile.Close();
	return TRUE;
}


void CSTM32ISPDlg::OnCheckGo() 
{
	// TODO: Add your control notification handler code here
	if(BST_CHECKED==((CButton*)GetDlgItem(IDC_CHECK_GO))->GetCheck()){
		Go_Run=1;
	}
	else{
		Go_Run=0;
	}

	CString Path(AfxGetApp()->m_pszHelpFilePath);
	char Drive[3], Dir[256], Fname[256], Ext[256];
    _splitpath(Path,Drive,Dir,Fname,Ext);
	
	CString ConfFile;
	ConfFile.Format("%s%s%s", Drive, Dir , "Default.conf");

	CIni Ini((LPCSTR)ConfFile);

	UpdateData(TRUE);
	Ini.WriteBool((LPCTSTR)"CMD",(LPCTSTR)"Go_Run",Go_Run);
	UpdateData(FALSE);
}


void CSTM32ISPDlg::OnSelchangeTab1(NMHDR* pNMHDR, LRESULT* pResult) 
{
	// TODO: Add your control notification handler code here
	int	CurSel =m_tab1.GetCurSel();
	switch(CurSel)
	{
	case 0:
		m_myisp.ShowWindow(true);
		m_myiap.ShowWindow(false);
		break;
	case 1:
		m_myisp.ShowWindow(false);
		m_myiap.ShowWindow(true);
		break;
	default:break;
	}
	
	*pResult = 0;
}
//wifi-dmx.com